doc/pmix3/PMIX2_Sample_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pmix="http://www.pmixpmp.org">
   <soap:Header>
      <pmix:MetaData>
         <pmix:Requestor>
            <!--PMIX role of the requestor-->
            <pmix:RequestorRole>Physicians</pmix:RequestorRole>
            <!--first name of the requestor:-->
            <pmix:RequestorGivenName>John</pmix:RequestorGivenName>
            <!--last name of the requestor-->
            <pmix:RequestorSurName>Doe</pmix:RequestorSurName>
            <!--1 or more repetitions:-->
            <pmix:RequestorIdentification>
            	<!-- DEA number of the requestor -->
               <pmix:IdentificationID>DEA123456789</pmix:IdentificationID>
               <pmix:IdentificationCategoryCode>DEA</pmix:IdentificationCategoryCode>
            </pmix:RequestorIdentification>
            <pmix:RequestorIdentification>
            	<!-- NPI number of the requestor -->
               <pmix:IdentificationID>NPI987654321</pmix:IdentificationID>
               <pmix:IdentificationCategoryCode>NPI</pmix:IdentificationCategoryCode>
            </pmix:RequestorIdentification>
            <!--Optional facility information-->
            <pmix:RequestorFacility>
               <pmix:RequestorOrganizationName>St. Peter's Hospital</pmix:RequestorOrganizationName>
               <!--1 or more repetitions:-->
               <pmix:FacilityIdentification>
                  <pmix:IdentificationID>NPI897645231</pmix:IdentificationID>
                  <pmix:IdentificationCategoryCode>NPI</pmix:IdentificationCategoryCode>
               </pmix:FacilityIdentification>
            </pmix:RequestorFacility>
         </pmix:Requestor>
         <!-- optional organization name
         <pmix:RequestorOrganization>
            <pmix:RequestorOrganizationName>ABC Health Corp</pmix:RequestorOrganizationName>
         </pmix:RequestorOrganization>
         -->
         <pmix:RoutingData>
         	   <!-- unique request identifer -->
            <pmix:RequestID>R80t7855801146</pmix:RequestID>

            <!-- timestamp when the request was sent -->
            <pmix:RequestDateTime>2020-02-28T20:47:25.255+05:30</pmix:RequestDateTime>

            <!-- RxCheck SiteCode of the requestor -->
            <pmix:RequestingState>QQ</pmix:RequestingState>

            <!-- echo back field 
            <pmix:StateRequestID>QQ_123</pmix:StateRequestID>
            -->

            <!-- RxCheck SiteCode of the disclosing state -->
            <!-- for federated query, send a comma seperated SIteCodes -->
            <!-- for eg: NJ,PA,CA -->
            <pmix:DisclosingState>QQ</pmix:DisclosingState>

            <!-- optional fields 
            <pmix:StateDisclosureID>not_used_in_rxcheck</pmix:StateDisclosureID>
            <pmix:HubRequestID>not_used_in_rxcheck</pmix:HubRequestID>            
            <pmix:HubDisclosureID>not_used_in_rxcheck</pmix:HubDisclosureID>
            -->

            <!-- this will be returned in the response
            <pmix:HubUsedIdentification>
               <pmix:HubIdentificationID>01</pmix:HubIdentificationID>
               <pmix:HubIdentificationCode>RxCheck</pmix:HubIdentificationCode>
            </pmix:HubUsedIdentification>
            -->
         </pmix:RoutingData>
      </pmix:MetaData>
   </soap:Header>
   <soap:Body>
      <pmix:RequestType>
         <pmix:RequestData><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<pmix:PMPRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:pmix="http://pmixpmp.org/niem/4.0/" xmlns:s="http://release.niem.gov/niem/structures/4.0/" xmlns:nc="http://release.niem.gov/niem/niem-core/4.0/" xmlns:j="http://release.niem.gov/niem/domains/jxdm/6.2/" xmlns:pmp="http://pmixpmp.org/niem/4.0/extension" xsi:schemaLocation="http://pmixpmp.org/niem/4.0/ ../../../workspace/tetrus/projects/RxCheck/Nebraska/Tom%20Carlson/schema_2021-08-31/schema/information/exchange/PMIX_NIEM_4.0_Request_Schema.xsd">
	<pmp:RequestPrescriptionDateRange>
		<pmp:RequestPrescriptionDateRangeBegin>2021-03-17</pmp:RequestPrescriptionDateRangeBegin>
		<pmp:RequestPrescriptionDateRangeEnd>2022-03-17</pmp:RequestPrescriptionDateRangeEnd>
	</pmp:RequestPrescriptionDateRange>
	<pmp:RequestPatient>
		<nc:PersonBirthDate>
			<nc:Date>2000-10-10</nc:Date>
		</nc:PersonBirthDate>
		<nc:PersonName>
			<nc:PersonGivenName>John</nc:PersonGivenName>
			<nc:PersonSurName>Doe</nc:PersonSurName>
			<nc:PersonNameSuffixText>Mr.</nc:PersonNameSuffixText>
		</nc:PersonName>
		<j:PersonSexCode>U</j:PersonSexCode>
		<nc:PersonSSNIdentification>
			<nc:IdentificationID>String</nc:IdentificationID>
			<nc:IdentificationJurisdiction>
				<nc:JurisdictionText>String</nc:JurisdictionText>
			</nc:IdentificationJurisdiction>
		</nc:PersonSSNIdentification>
		<pmp:PersonPrimaryContactInformation>
			<nc:ContactTelephoneNumber>
				<nc:FullTelephoneNumber>
					<nc:TelephoneNumberFullID>123-45-6789</nc:TelephoneNumberFullID>
				</nc:FullTelephoneNumber>
			</nc:ContactTelephoneNumber>
			<nc:ContactMailingAddress>
				<nc:LocationStreet>
					<nc:StreetFullText>String</nc:StreetFullText>
				</nc:LocationStreet>
				<nc:LocationCityName>String</nc:LocationCityName>
				<nc:LocationState>
					<nc:LocationStateUSPostalServiceCode>NJ</nc:LocationStateUSPostalServiceCode>
				</nc:LocationState>
				<nc:LocationPostalCode>String</nc:LocationPostalCode>
				<nc:LocationPostalExtensionCode>String</nc:LocationPostalExtensionCode>
			</nc:ContactMailingAddress>
		</pmp:PersonPrimaryContactInformation>
		<pmp:PersonStateIssuedIdentifier>
			<nc:IdentificationID>String</nc:IdentificationID>
			<nc:IdentificationJurisdiction>
				<nc:JurisdictionText>String</nc:JurisdictionText>
			</nc:IdentificationJurisdiction>
		</pmp:PersonStateIssuedIdentifier>
		<pmp:SpeciesCode>01</pmp:SpeciesCode>
		<pmp:PatientLocationCode>01</pmp:PatientLocationCode>
		<pmp:PatientNameOfAnimalText>String</pmp:PatientNameOfAnimalText>
	</pmp:RequestPatient>
</pmix:PMPRequest>]]></pmix:RequestData>
      </pmix:RequestType>
   </soap:Body>
</soap:Envelope>